app/units/save_fetched_movie/action.rb

INSERT INTO "movies" ("title", "created_at", "updated_at", "year", "rated", "released", "runtime", "genre", "director", "writer", "actors", "plot", "language", "country", "awards", "poster", "ratings", "metascore", "imdb_rating", "imdb_votes", "imdb_id", "movie_type", "dvd", "box_office", "production", "website") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26) RETURNING "id"
---
    def save_fetched_movie
      Movie.create(movie_attributes)